export const mockComment = [
  {
    text: '타입스크립트 공부중인데 너무너무 기대됩니다!!',
    likes: 0,
  },
  {
    text: '음? 넘나 기대되눈거 ㅠ',
    likes: 210,
  },
  {
    text: '잘 읽고 갑니다!',
    likes: 0,
  },
  {
    text: '현재 타입스크립트 공부중인데 기대되요~!!! 감ㅅㅏ합니다! ',
    likes: 0,
  },
  {
    text: '출퇴근길에 너무 재밌게 잘 읽습니다\n감사합니다! 😀😀',
    likes: 0,
  },
  {
    text: '타입스크립트 공부 시작해보겠습니다.\n언제나 양질의 컨텐츠 감사드려요 ^^',
    likes: 0,
  },
  {
    text: '이 글이 있어 정말 다행이다 싶습니다! 감사합니당 ㅎㅎ',
    likes: 0,
  },
  {
    text: '감사합니다 :)',
    likes: 3,
  },
  {
    text: '저는 connect에서 액션생성함수 가져올때 객체로 전달해주는거 최근에 알았어요. \n이래서 API 문서를 꼼꼼히 살펴보아야하는데.....ㅠㅠ 포스팅 잘 보았습니다.',
    likes: 0,
  },
  {
    text: '벨로퍼트님 덕분에 리덕스를 쉽게 깨우쳤(?)습니다. 감사합니다!',
    likes: 30,
  },
  {
    text: '감사합니다! 제 redux의 첫 교과서가 되어주셔서!\n여쭤보고 싶은게 이 예제에서 사용하는 redux 구조가 어떤 것인지 궁금합니다.\nducks pattern을 기반으로 해서 보안한 패턴인가요?',
    likes: 10,
  },
  {
    text: '작성해주신 글 중에 문의드릴 내용이 있어서 댓글 남기게 되었습니다. 아래 값에서 ":"을 처음 보게 되었는데요, 해당 부분이 어떠한 역할을 수행하는 syntax인가요? 객체로 인스터스화 한다는 의미인가요? 아니라면 관련하여 참고할 자료가 있으시면 공유부탁드립니다.  \n\n// props 로 넣어줄 스토어 상태값\nconst mapStateToProps = state => ({\n  color: state.counter.color,\n});\n\n// props 로 넣어줄 액션 생성함수\nconst mapDispatchToProps = dispatch => ({\n  changeColor: color => dispatch(changeColor(color)),\n});',
    likes: 9,
  },
  {
    text: '감사합니다 너무 잘 정리되어있네@요!',
    likes: 5,
  },
  {
    text: '잘보고 갑니다 많은도움이 되었어요!!',
    likes: 10,
  },
  {
    text: '감사합니다.',
    likes: 20,
  },
]
